// 퀴즈1: 주어진 배열 안의 딸기 아이템을 키위로 교체하는 함수를 만들기
// 단, 주어진 배열을 수정하지 않도록한다.
// input:['🍌','🍓','🍇','🍓']
// output:['🍌','🥝','🍇','🥝']

function changed(input) {
  const change = Array.from(input)
  for(let i = 0; i < change.length; i++){
    if(change[i] === '🍓') {
      change[i] = '🥝';
    }
  }
  return change;
}

const input = ['🍌','🍓','🍇','🍓'];
const output = changed(input);
console.log(output);

/** 퀴즈2: 배열과 특정한 요소를 전달받아,
 *  배열안에 그 요소가 몇개나 있는지 카운트 하는 함수 만들기
 *  input: ['🍌','🥝','🍇','🥝'], '🥝'
 *  output: 2 
 */

function counter(fruits, item) {
  let sum = 0;
  for(let i = 0; i < fruits.length; i++) {
    if(fruits[i] === item) {
      sum ++;
    }
  }
  return sum;
}
const fruits = ['🍌','🥝','🍇','🥝'];
console.log(counter(fruits,'🥝'));

/** 퀴즈3: 배열1, 배열2 두개의 배열을 전달받아,
 *  배열1 아이템중 배열2에 존재하는 아이템만 담고 있는 배열 반환
 *  input['🍌','🥝','🍇'], ['🍌','🍓','🍇','🍓']
 *  output ['🍌','🍇']
 */